AI_Debug/InformationRegisters/AI_Settings.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>AI_Settings</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ключ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AI_Debug/CommonModules/AI_Security_Test/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Модуль AI_Security_Test: тесты контроля доступа (AI_Security).
//
// Запуск: run_unit_tests({"moduleName": "AI_Security_Test"})
//

#Область СлужебныйПрограммныйИнтерфейс

// Обязательная функция — точка входа для run_unit_tests.
//
Функция ИсполняемыеСценарии() Экспорт
	Возврат ЮТТесты.СписокТестов(
		"ПроверитьДоступ_БезНастройки_ВсёРазрешено",
		"ПроверитьДоступ_ReadOnly_ПишущиеЗапрещены",
		"ПроверитьДоступ_ReadOnly_ЧитающиеРазрешены",
		"ПроверитьДоступ_ReadOnlyВыключен_ВсёРазрешено",
		"ЭтоПишущийИнструмент_Классификация",
		"GetAccessRights_ТекущийПользователь_ПраваЕсть");
КонецФункции

#КонецОбласти

#Область Тесты

Процедура ПроверитьДоступ_БезНастройки_ВсёРазрешено() Экспорт

	УдалитьНастройкуReadOnly();
	ЮТУтверждения.ЭтоИстина(AI_Security.ПроверитьДоступ("create_document"));
	ЮТУтверждения.ЭтоИстина(AI_Security.ПроверитьДоступ("execute_code"));

КонецПроцедуры

Процедура ПроверитьДоступ_ReadOnly_ПишущиеЗапрещены() Экспорт

	УстановитьНастройкуReadOnly("true");
	Попытка
		ЮТУтверждения.ЭтоЛожь(AI_Security.ПроверитьДоступ("create_document"));
		ЮТУтверждения.ЭтоЛожь(AI_Security.ПроверитьДоступ("post_document"));
		ЮТУтверждения.ЭтоЛожь(AI_Security.ПроверитьДоступ("delete_object"));
		ЮТУтверждения.ЭтоЛожь(AI_Security.ПроверитьДоступ("execute_code"));
	Исключение
		УдалитьНастройкуReadOnly();
		ВызватьИсключение;
	КонецПопытки;
	УдалитьНастройкуReadOnly();

КонецПроцедуры

Процедура ПроверитьДоступ_ReadOnly_ЧитающиеРазрешены() Экспорт

	УстановитьНастройкуReadOnly("да");
	Попытка
		ЮТУтверждения.ЭтоИстина(AI_Security.ПроверитьДоступ("execute_query"));
		ЮТУтверждения.ЭтоИстина(AI_Security.ПроверитьДоступ("get_document"));
		ЮТУтверждения.ЭтоИстина(AI_Security.ПроверитьДоступ("get_tech_log"));
		ЮТУтверждения.ЭтоИстина(AI_Security.ПроверитьДоступ("run_unit_tests"));
	Исключение
		УдалитьНастройкуReadOnly();
		ВызватьИсключение;
	КонецПопытки;
	УдалитьНастройкуReadOnly();

КонецПроцедуры

Процедура ПроверитьДоступ_ReadOnlyВыключен_ВсёРазрешено() Экспорт

	УстановитьНастройкуReadOnly("false");
	Попытка
		ЮТУтверждения.ЭтоИстина(AI_Security.ПроверитьДоступ("create_document"));
	Исключение
		УдалитьНастройкуReadOnly();
		ВызватьИсключение;
	КонецПопытки;
	УдалитьНастройкуReadOnly();

КонецПроцедуры

Процедура ЭтоПишущийИнструмент_Классификация() Экспорт

	ЮТУтверждения.ЭтоИстина(AI_Security.ЭтоПишущийИнструмент("update_document"));
	ЮТУтверждения.ЭтоИстина(AI_Security.ЭтоПишущийИнструмент("write_information_register"));
	ЮТУтверждения.ЭтоИстина(AI_Security.ЭтоПишущийИнструмент("configure_logcfg"));
	ЮТУтверждения.ЭтоЛожь(AI_Security.ЭтоПишущийИнструмент("get_document"));
	ЮТУтверждения.ЭтоЛожь(AI_Security.ЭтоПишущийИнструмент("execute_query"));
	ЮТУтверждения.ЭтоЛожь(AI_Security.ЭтоПишущийИнструмент("get_access_rights"));

КонецПроцедуры

Процедура GetAccessRights_ТекущийПользователь_ПраваЕсть() Экспорт

	// Справочник AI_Обращения — собственный объект расширения, есть всегда
	Результат = AI_Metadata.ВыполнитьИнструмент("get_access_rights",
		Новый Структура("objectKind,objectName", "Справочники", "AI_Обращения"));

	ЮТУтверждения.ЭтоИстина(Результат.success, "get_access_rights должен отработать");
	ЮТУтверждения.ЭтоИстина(Результат.data.rights.Чтение,
		"у учётки сервиса должно быть чтение AI_Обращения");
	ЮТУтверждения.Равно(Результат.data.user, "<текущая учётка сервиса>");

	// Несуществующий объект — понятная ошибка, не падение
	Плохой = AI_Metadata.ВыполнитьИнструмент("get_access_rights",
		Новый Структура("objectKind,objectName", "Справочники", "НетТакогоСправочника"));
	ЮТУтверждения.ЭтоЛожь(Плохой.success);
	ЮТУтверждения.ЭтоИстина(СтрНайти(Плохой.error, "не найден") > 0);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьНастройкуReadOnly(Значение)

	УдалитьНастройкуReadOnly();

	МенеджерЗаписи = РегистрыСведений.AI_Settings.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Ключ = "ReadOnlyMode";
	МенеджерЗаписи.Значение = Значение;
	МенеджерЗаписи.Записать();

КонецПроцедуры

Процедура УдалитьНастройкуReadOnly()

	МенеджерЗаписи = РегистрыСведений.AI_Settings.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Ключ = "ReadOnlyMode";
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.Выбран() Тогда
		МенеджерЗаписи.Удалить();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
